In [1]:
import pandas as pd

In [2]:
df_cat = pd.read_csv("preferences/cat.csv")
df_loc =  pd.read_csv("preferences/loc.csv")
df_price =  pd.read_csv("preferences/price.csv")
df_rat =  pd.read_csv("preferences/rat.csv")
df_type =  pd.read_csv("preferences/type.csv")

## Categories

In [3]:
df_cat.head()

      name   age  category subcategory    filter                        time
0  Julieta  23.0  select..    select..  category  2021-05-17 19:05:23.584347
1  Julieta  23.0     party    select..  category  2021-05-17 19:05:26.649778
2  Julieta  23.0     party     dancing  category  2021-05-17 19:05:30.102997

In [4]:
df_cat.drop(df_cat[df_cat.category == "select.."].index, inplace=True)
df_cat.drop(df_cat[df_cat.subcategory == "select.."].index, inplace=True)
df_cat = df_cat.reset_index()
df_cat.drop(["index"],axis=1,inplace=True)

In [5]:
df_cat

      name   age category subcategory    filter                        time
0  Julieta  23.0    party     dancing  category  2021-05-17 19:05:30.102997

## Location

In [6]:
df_loc

,name,age,where,district,filter,time
0,Julieta,23.0,Madrid,Chamartín,location,2021-05-17 19:05:48.343924
1,Gala,3.0,Other towns in Madrid,Alcobendas,location,2021-05-17 19:14:37.002046
2,Juli,23.0,Other towns in Madrid,Alcobendas,location,2021-05-17 19:15:22.709230

## Price

In [7]:
df_price

      name   age  max filter                        time
0  Julieta  23.0   80  price  2021-05-17 19:06:14.159666

## Type

In [8]:
df_type

      name   age           type filter                        time
0  Julieta  23.0  team building   type  2021-05-17 19:06:03.647907
1  Julieta  23.0         couple   type  2021-05-17 19:06:58.319326
2  Julieta  23.0  team building   type  2021-05-17 19:07:32.577682
3     Gala   3.0     individual   type  2021-05-17 19:09:35.093325
4     Gala   5.0         couple   type  2021-05-17 19:10:05.369347
5     Gala   3.0         family   type  2021-05-17 19:10:27.321624
6     Gala   3.0         family   type  2021-05-17 19:10:46.939912

## Rating

In [9]:
df_rat

      name   age  min  filter                        time
0  Julieta  23.0  4.9  rating  2021-05-17 19:06:23.870826